<?php

namespace App\Datas;

class Joke extends Data
{
    public function data(): array
    {
        return [

"有一天～老師問小明：「１＋１＝多少」
小明：「不知道」
老師：「回家問家人，明天再告訴我」
小明：「喔喔」

回到家--
小明先去問媽媽，媽媽在炒菜
媽媽說：「我不知啦！去問你爸」
小明：「喔～」
去問爸爸，爸爸在看報紙
就說：「你知道現在政治多亂嗎！還在吵！」
小明：「喔～」
他又去問奶奶，奶奶老了耳朵聽不清楚
就說：「我老了～你自己去吧」
小明：「喔～」
最後他去問姊姊，姊姊在唱歌
唱：「我家住再馬桶裡呀～一押一押唷～」
原歌（我家門前有塊地呀～一押一押唷～）

小明隔天去學校，
老師問他１＋１＝？
小明：「我不知道啦！去問你爸」
老師：「（怒）我再問你一次１＋１＝？」
小明：「你知道現在政治多亂嗎！還在吵！」
老師：「你跟我去辦公室」
小明：「我老了，你自己去吧～」
老師：「（極限..）你家住哪？我今天去一趟拜訪你父母，
小明：「我家住再馬桶裡呀～一押一押唷～」
老師：「.........」",

"在一個鄉下的酒吧裡，有兩個牧師在一起喝酒，不久因喝多了而十分興奮，
其中一個牧師便建議騎車去兜風。
騎車的牧師就來個放開雙手騎車的特技，好死不死被巡警撞見，
便被攔了下來：「酒後駕車，特技行駛，再加上兩人沒載安全帽，準罰死你們！」
牧師見狀忙道：「警察大人，剛剛我沒有特技行駛，而是上帝在操縱著機車呢！」
警察一聽，又拿出了罰單邊寫邊說：「三貼再加上一人沒載安全帽，簽名吧！」",

"結婚前And結婚後

先從上往下看 往↓看：

他：太好了！我期盼的日子終於來臨了！我都等不及了！
她：我可以反悔嗎？
他：不，你甚至想都別想！
她：你愛我嗎？
他：當然！
她：你會背叛我嗎？
他：不會，你怎麼會有這種想法？
她：你可以吻我一下嗎？
他：當然，絕不可能只有一下！
她：你有可能打我嗎？
他：永遠不可能！
她：我能相信你嗎？

再從下往上看 往↑看",

"有一個台灣警察趁著休假到美國玩，
突然有兩輛車在他面前相撞 ，
見義勇為的他發揮警察精神，打電話報案
可是突然想起自己是英語白痴，結果對話是：
美國警察:What's happen?I help you?
(怎麼了?我能幫你做什麼嗎?)
台灣人:One car come.
(一輛車過來)
One car go.
(一輛車過去)
One car no ba.
(一輛車沒叭[按喇叭])
One car no stop.
(一輛車沒停)
Two car long-ga-bin-biang-gyo.
(兩輛車[哢尬鬢ㄅㄧㄤˋ叫](撞到)
Please O-E O-E come.
(請[喔一 喔一](救護車)來)
美國警察:=_=\"@#@#$$@??>>><",

"電影大亨決心製作一部有史以來規模最偉大的巨片「我要動用前所未見的陣容來演那戰爭場面。」

他揚言「雙方各用兩萬五千名臨時演員。」

「那好極了！」導演半信半疑地說「可是，我們怎樣付得起那麼多錢給他們呢？」

「計劃的妙處就是，」大亨回答，「我們要用真槍實彈。」",

"有一天小明和媽媽在客廳看電視，突然門鈴作響，媽媽跑去開門，來了一位陌生男人，這時小明也跟了過來，媽媽便對小明說：「叫爸爸！」

小明心理在想，很奇怪，我為何要叫他爸爸？所以小明不出聲，這時媽媽看小明不出聲，又大聲對小明說：「快叫爸爸！」

小明還是不肯出聲，這時媽媽生氣了，打了小明一巴掌並又對他說：「快叫爸爸！」這時小明只好哭著對陌生人喊：「爸爸......」

這時媽媽哭笑不得地對小明說：「誰叫你叫他爸爸呀！我是叫你去房間叫你爸爸出來繳電費啦！」",

"「早報！早報！20塊錢一份！」
1個人買了一份報紙，過了一會兒回來問賣報生說：「喂！這上面明明寫著10塊錢一份呀！」
「ㄝˊ！你覺得報紙上寫的情，都是真的嗎？」",

"「請問你們有沒有德國種短毛獵犬？我想買一頭，」有人問寵物店主人。
「有，而且是好的不得了！」
「好極了。不過，那頭狗忠心嗎？」
「當然。已經賣過牠四次，每次牠都能自己跑回來！」",

"「你說這隻戒指是在街上拾到的，那麼你為什麼不把它送還原主？」
「因為戒指上刻著「永遠是你的」。」",

"化學老師一向幽默，某日上課時對全班說：「人家說單眼皮的人聰明，雙眼皮漂亮。」
小明說：「你們看我，一單一雙。」",

        ];
    }
}
